exercicios avaliacao

In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.options.display.float_format = '{:,.2f}'.format

Problema 1
Vamos praticar gerar matrizes e fazer operações com as linhas e colunas:

(a) Crie uma matriz A com as dimensões (5, 4) e elementos aleatórios variando entre 0 e 50, com o 50 incluso;

Dica: Utilize as funções np.random.randint e np.reshape

(b) Retorne a média do vetor

(c) Retorne os menores valores de cada coluna;

(d) Retorne os maiores valores de cada linha.

In [3]:
a = np.random.randint(low=0, high=50, size=20).reshape(5,4)

In [4]:
a

array([[ 9, 21, 30, 33],
       [19, 11,  5, 31],
       [33,  3, 19, 35],
       [32,  1, 46, 12],
       [ 2,  9, 34, 24]])

(b) Retorne a média do vetor

In [5]:
np.mean(a)

20.45

(c) Retorne os menores valores de cada coluna;

In [6]:
np.min(a , axis=1)

array([9, 5, 3, 1, 2])

(d) Retorne os maiores valores de cada linha.

In [7]:
np.max(a , axis =0)

array([33, 21, 46, 35])

===============================================================================================================

In [8]:
tabela = ([[47,161,31],
          [80,170,21],
          [60,175,16],
          [90,162,28],
          [100,185,23],
          [147,189,32]])

In [9]:
df = pd.DataFrame(tabela , columns=["Peso (Kg)", "Altura (cm)", "idade (anos)"])

In [10]:
df

   Peso (Kg)  Altura (cm)  idade (anos)
0         47          161            31
1         80          170            21
2         60          175            16
3         90          162            28
4        100          185            23
5        147          189            32

(a) Visualize apenas os dados da coluna que contém a altura das pessoas;

In [11]:
df.iloc[:,1]

0    161
1    170
2    175
3    162
4    185
5    189
Name: Altura (cm), dtype: int64

(b) Obtenha a idade média das pessoas;

In [12]:
 media = df["idade (anos)"].mean()
media

25.166666666666668

(c) Obtenha os dados das pessoas que estão abaixo da altura média;

In [13]:
df[df["idade (anos)"] < media]

   Peso (Kg)  Altura (cm)  idade (anos)
1         80          170            21
2         60          175            16
4        100          185            23

(d) Crie um nova coluna no DataFrame que contenha o IMC (Índice de Massa Corporal) de cada pessoa;

In [14]:
dfconvertido = df["Altura (cm)"]/100

In [15]:
imc = df["Peso (Kg)"] / (df["Altura (cm)"]/100)**2

In [16]:
imc

0   18.13
1   27.68
2   19.59
3   34.29
4   29.22
5   41.15
dtype: float64

(e) Remova a coluna que contém a idade das pessoas;

In [17]:
del df["idade (anos)"]
df

   Peso (Kg)  Altura (cm)
0         47          161
1         80          170
2         60          175
3         90          162
4        100          185
5        147          189

In [18]:
imc_classificacao = []
for i in imc:
    if i < 18.5:
        imc_classificacao.append("Subpeso")
    elif ( i >= 18.5) and (i <= 24.9):
        imc_classificacao.append("Normal")
    elif ( i >= 25) and (i <= 29.9):
        imc_classificacao.append("Sobrepeso")
    elif ( i >= 30) and (i <= 39.9):
        imc_classificacao.append("Obesidade Grau I ")
    elif i >40:   
        imc_classificacao.append("Obesidade Grau II ")

In [19]:
imc_classificacao

['Subpeso',
 'Sobrepeso',
 'Normal',
 'Obesidade Grau I ',
 'Sobrepeso',
 'Obesidade Grau II ']

In [20]:
df["IMC Classificação"] = imc_classificacao

In [21]:
df

   Peso (Kg)  Altura (cm)   IMC Classificação
0         47          161             Subpeso
1         80          170           Sobrepeso
2         60          175              Normal
3         90          162   Obesidade Grau I
4        100          185           Sobrepeso
5        147          189  Obesidade Grau II

In [22]:
df.to_csv('IMC.csv')

========================================================================================================================

In [23]:
avocato = pd.read_csv("data2/avocado.csv", sep=';')

In [24]:
avocato

             Date  AveragePrice  Total Volume  year            region
0      2015-12-27          1.33     64,236.62  2015            Albany
1      2015-12-20          1.35     54,876.98  2015            Albany
2      2015-12-13          0.93    118,220.22  2015            Albany
3      2015-12-06          1.08     78,992.15  2015            Albany
4      2015-11-29          1.28     51,039.60  2015            Albany
...           ...           ...           ...   ...               ...
18244  2018-02-04          1.63     17,074.83  2018  WestTexNewMexico
18245  2018-01-28          1.71     13,888.04  2018  WestTexNewMexico
18246  2018-01-21          1.87     13,766.76  2018  WestTexNewMexico
18247  2018-01-14          1.93     16,205.22  2018  WestTexNewMexico
18248  2018-01-07          1.62     17,489.58  2018  WestTexNewMexico

[18249 rows x 5 columns]

In [25]:
avocato_type = pd.read_excel("data2/avocado_type.xlsx")

In [26]:
avocato["type"] = avocato_type

In [27]:
avocato

,Date,AveragePrice,Total Volume,year,region,type
0,2015-12-27,1.33,"64,236.62",2015,Albany,orgânico
1,2015-12-20,1.35,"54,876.98",2015,Albany,convencional
2,2015-12-13,0.93,"118,220.22",2015,Albany,convencional
3,2015-12-06,1.08,"78,992.15",2015,Albany,orgânico
4,2015-11-29,1.28,"51,039.60",2015,Albany,orgânico
...,...,...,...,...,...,...
18244,2018-02-04,1.63,"17,074.83",2018,WestTexNewMexico,convencional
18245,2018-01-28,1.71,"13,888.04",2018,WestTexNewMexico,convencional
18246,2018-01-21,1.87,"13,766.76",2018,WestTexNewMexico,convencional
18247,2018-01-14,1.93,"16,205.22",2018,WestTexNewMexico,convencional
18248,2018-01-07,1.62,"17,489.58",2018,WestTexNewMexico,convencional

(a) A quantidade de abacates do tipo convecional e do tipo orgânico.

In [28]:
avocato.groupby(['type'])['type'].count()

type
convencional    9114
orgânico        9135
Name: type, dtype: int64

(b) A quantidade de registros (linhas) de abacates vendidos para cada região ordenada da maior venda para a menor.

In [29]:
avocato.groupby(['region'])['Total Volume'].count()

region
Albany                 338
Atlanta                338
BaltimoreWashington    338
Boise                  338
Boston                 338
BuffaloRochester       338
California             338
Charlotte              338
Chicago                338
CincinnatiDayton       338
Columbus               338
DallasFtWorth          338
Denver                 338
Detroit                338
GrandRapids            338
GreatLakes             338
HarrisburgScranton     338
HartfordSpringfield    338
Houston                338
Indianapolis           338
Jacksonville           338
LasVegas               338
LosAngeles             338
Louisville             338
MiamiFtLauderdale      338
Midsouth               338
Nashville              338
NewOrleansMobile       338
NewYork                338
Northeast              338
NorthernNewEngland     338
Orlando                338
Philadelphia           338
PhoenixTucson          338
Pittsburgh             338
Plains                 338
Portland               338
RaleighGreensboro      338
RichmondNorfolk        338
Roanoke                338
Sacramento             338
SanDiego               338
SanFrancisco           338
Seattle                338
SouthCarolina          338
SouthCentral           338
Southeast              338
Spokane                338
StLouis                338
Syracuse               338
Tampa                  338
TotalUS                338
West                   338
WestTexNewMexico       335
Name: Total Volume, dtype: int64

(c) Para que todos os labels das colunas fiquem padronizados, renomeie aqueles que estão iniciando em letra minúscula para que iniciem em letra maiúscula, trocando espaço por e adicionando como separação de texto.

In [30]:
avocato = avocato.rename(columns=str.capitalize)

In [31]:
avocato

,Date,Averageprice,Total volume,Year,Region,Type
0,2015-12-27,1.33,"64,236.62",2015,Albany,orgânico
1,2015-12-20,1.35,"54,876.98",2015,Albany,convencional
2,2015-12-13,0.93,"118,220.22",2015,Albany,convencional
3,2015-12-06,1.08,"78,992.15",2015,Albany,orgânico
4,2015-11-29,1.28,"51,039.60",2015,Albany,orgânico
...,...,...,...,...,...,...
18244,2018-02-04,1.63,"17,074.83",2018,WestTexNewMexico,convencional
18245,2018-01-28,1.71,"13,888.04",2018,WestTexNewMexico,convencional
18246,2018-01-21,1.87,"13,766.76",2018,WestTexNewMexico,convencional
18247,2018-01-14,1.93,"16,205.22",2018,WestTexNewMexico,convencional
18248,2018-01-07,1.62,"17,489.58",2018,WestTexNewMexico,convencional

(d) Essa dado possui duplicados? Se sim, remova-os do dataset.

In [32]:
duplicados = avocato.duplicated()

In [33]:
duplicados

0        False
1        False
2        False
3        False
4        False
         ...
18244    False
18245    False
18246    False
18247    False
18248    False
Length: 18249, dtype: bool

In [34]:
duplicados.groupby(duplicados.iloc[:]).count()

False    18249
dtype: int64

(e) Retire dos dados a região 'TotalUS'

(g) Apresente as regiões que mais venderam abacate em todo o período em ordem decrescente.

In [35]:
avocato.groupby(['Region'])['Total volume'].sum().sort_values(ascending=False)

Region
TotalUS               5,864,740,181.80
West                  1,086,779,155.75
California            1,028,981,653.17
SouthCentral          1,011,279,618.83
Northeast               713,280,909.56
Southeast               615,238,409.11
GreatLakes              589,642,549.29
Midsouth                508,349,357.20
LosAngeles              507,896,547.63
Plains                  311,188,529.11
NewYork                 240,734,127.53
DallasFtWorth           208,419,286.55
Houston                 203,167,867.80
PhoenixTucson           195,643,312.50
WestTexNewMexico        144,521,839.78
Denver                  138,902,535.99
SanFrancisco            135,830,191.78
BaltimoreWashington     134,713,919.32
Chicago                 133,702,338.51
Portland                110,552,211.60
Seattle                 109,214,177.96
MiamiFtLauderdale        97,673,224.03
Boston                   97,273,984.83
SanDiego                 89,791,919.69
Atlanta                  88,605,118.85
Sacramento               75,163,746.86
Philadelphia             71,838,798.18
NorthernNewEngland       71,532,894.11
Tampa                    66,004,539.31
Detroit                  63,422,419.38
SouthCarolina            60,753,772.90
Orlando                  58,660,703.89
LasVegas                 54,376,906.40
HartfordSpringfield      50,670,537.46
RaleighGreensboro        48,202,731.66
NewOrleansMobile         45,695,136.58
CincinnatiDayton         44,522,007.57
RichmondNorfolk          42,230,851.45
HarrisburgScranton       41,808,858.68
Nashville                35,612,089.23
Charlotte                35,555,544.42
StLouis                  32,072,833.33
Indianapolis             30,263,391.43
GrandRapids              30,211,735.93
Columbus                 29,993,361.42
Jacksonville             28,790,004.74
Roanoke                  25,042,010.81
BuffaloRochester         22,962,470.40
Pittsburgh               18,806,345.81
Louisville               16,097,002.40
Albany                   16,067,799.97
Spokane                  15,565,275.48
Boise                    14,413,187.75
Syracuse                 10,942,667.68
Name: Total volume, dtype: float64

(h) Calcule o volume total de abacates vendidos para cada tipo e ano.

In [36]:
avocato.groupby(['Type', 'Year'])['Total volume'].sum()

Type          Year
convencional  2015   2,262,212,670.62
              2016   2,537,092,185.32
              2017   2,387,148,981.92
              2018     753,606,839.89
orgânico      2015   2,123,255,991.42
              2016   2,283,797,706.51
              2017   2,547,156,717.35
              2018     629,131,500.37
Name: Total volume, dtype: float64

(f) existe alguma região que foi a maior responsável pela queda na produção de 2018?

In [37]:
ano = avocato[avocato["Year"]==2018]
avocato.groupby(['Year', 'Region' ])['Total volume'].sum().sort_values()

Year  Region
2018  Syracuse         1,046,987.66
      Boise            1,214,759.57
      Spokane          1,225,893.47
      Louisville       1,471,561.01
      Albany           1,541,986.17
                         ...
2017  West           345,054,416.10
2018  TotalUS        523,632,254.22
2015  TotalUS      1,657,255,221.42
2016  TotalUS      1,819,159,142.78
2017  TotalUS      1,864,693,563.38
Name: Total volume, Length: 216, dtype: float64

(g) Qual cidade menos faturou com a venda de abacates?

Syracuse

======================================================================================================================

Problema 4
Com base no dataset 'Video_Games_Sales.csv' responda:

(a) Quantos jogos existem em cada genero?

In [38]:
games = pd.read_excel("data2/Video_Games_Sales.xlsx")

In [39]:
def limpar_dados(c1,c2,c3,c4,c5,c6,c7,c8,c9):
    
    games[[c1,c2,c3,c4,c5,c6,c7,c8,c9]] = games[[c1,c2,c3,c4,c5,c6,c7,c8,c9]].astype(str)
    
    for i in [c1,c2,c3,c4,c5,c6,c7,c8,c9]:
        for t in games[i]:
            if ':' in t:
                games.replace({t:'0'}, inplace=True)

                
    games[[c1,c2,c3,c4,c5,c6,c7,c8,c9]] = games[[c1,c2,c3,c4,c5,c6,c7,c8,c9]].astype(float)

In [40]:
limpar_dados('NA_Sales','EU_Sales','JP_Sales','Other_Sales','Global_Sales','Critic_Score','Critic_Count','User_Score','User_Count')
games = games.fillna(0)

In [41]:
games.groupby(['Genre'])['Genre'].count()

Genre
0                  2
Action          3370
Adventure       1303
Fighting         849
Misc            1750
Platform         888
Puzzle           580
Racing          1249
Role-Playing    1500
Shooter         1323
Simulation       874
Sports          2348
Strategy         683
Name: Genre, dtype: int64

(b) Temos duplicados nesses dados? E nulos?

In [42]:
games2 = games.duplicated()
games2.groupby(games2.iloc[:]).count()

False    16719
dtype: int64

In [43]:
games.isnull().sum()

Name               0
Platform           0
Year_of_Release    0
Genre              0
Publisher          0
NA_Sales           0
EU_Sales           0
JP_Sales           0
Other_Sales        0
Global_Sales       0
Critic_Score       0
Critic_Count       0
User_Score         0
User_Count         0
Developer          0
Rating             0
dtype: int64

(b) Quantos jogos de cada publisher receberam nota acima de 9 na avaliação dos usuarios?

In [55]:
notas = games[games['Critic_Score'] >= 9]
notas

notas.groupby(['Publisher'])[['Critic_Score']   ].count()

                      Critic_Score
Publisher
0                                4
10TACLE Studios                  1
1C Company                       3
2D Boy                           1
3DO                             17
...                            ...
Zoo Games                        6
Zushi Games                      2
bitComposer Games                4
id Software                      1
inXile Entertainment             1

[304 rows x 1 columns]

(c) Faça uma tabela que mostre o total vendido por ano por pais/globalmente de cada publisher? Você consegue observar algum padrão? Com se comportaram as vendas na América do Norte (NA) ao longo do tempo? O mesmo foi visto nos demais lugares?

In [45]:
games.groupby(['Publisher','Year_of_Release'])[['NA_Sales','EU_Sales','JP_Sales','Other_Sales','Global_Sales']].sum().head(60)

                                              NA_Sales  EU_Sales  JP_Sales  \
Publisher                    Year_of_Release
0                            0.00                 2.76      1.23      0.90
                             2,004.00             3.79      1.40      0.00
                             2,005.00             1.03      0.38      0.00
                             2,007.00             0.87      0.32      0.00
                             2,010.00             0.00      0.16      0.00
                             2,011.00             0.06      0.13      0.00
                             2,016.00             0.00      0.00      0.03
10TACLE Studios              2,006.00             0.01      0.01      0.00
                             2,007.00             0.06      0.03      0.00
1C Company                   2,009.00             0.00      0.01      0.00
                             2,011.00             0.01      0.06      0.00
20th Century Fox Video Games 1,981.00             1.27      0.07      0.00
                             1,982.00             0.55      0.03      0.00
2D Boy                       2,008.00             0.00      0.03      0.00
3DO                          1,998.00             0.30      0.09      0.00
                             1,999.00             1.91      0.96      0.00
                             2,000.00             1.86      1.04      0.00
                             2,001.00             0.76      0.56      0.00
                             2,002.00             0.30      0.23      0.00
                             2,003.00             0.25      0.16      0.00
49Games                      2,009.00             0.00      0.03      0.00
505 Games                    2,002.00             0.02      0.02      0.25
                             2,003.00             0.05      0.04      0.00
                             2,004.00             0.49      0.30      0.00
                             2,005.00             0.89      0.17      0.08
                             2,006.00             1.03      2.06      0.55
                             2,007.00             4.44      1.67      0.49
                             2,008.00             2.07      0.29      0.17
                             2,009.00             4.67      1.83      0.21
                             2,010.00             8.41      4.29      0.01
                             2,011.00             1.95      0.86      0.06
                             2,012.00             0.89      1.01      0.08
                             2,013.00             1.01      0.82      0.09
                             2,014.00             0.70      0.79      0.01
                             2,015.00             0.25      0.30      0.00
                             2,016.00             0.09      0.62      0.05
5pb                          2,008.00             0.00      0.00      0.10
                             2,009.00             0.00      0.00      0.18
                             2,010.00             0.00      0.00      0.29
                             2,011.00             0.02      0.00      0.25
                             2,012.00             0.00      0.00      0.26
                             2,013.00             0.00      0.00      0.14
                             2,014.00             0.00      0.00      0.13
                             2,015.00             0.00      0.00      0.22
                             2,016.00             0.00      0.00      0.07
7G//AMES                     2,011.00             0.00      0.05      0.00
989 Sports                   1,999.00             0.21      0.14      0.00
989 Studios                  1,997.00             0.29      0.19      0.00
                             1,998.00             5.66      1.45      0.10
                             1,999.00             2.21      1.66      0.00
AQ Interactive               2,007.00             0.06      0.05      0.04
                             2,008.00             0.19      0.01      0.00
                             2,009.00             0.07      0.00      0.07
ASC Games                    1,996.00             0.73      0.50      0.00
                             1,998.00             0.36      0.25      0.00
                             1,999.00             0.03      0.02      0.00
ASCII Entertainment          1,994.00             0.00      0.00      0.87
                             1,995.00             0.00      0.00      1.25
                             1,996.00             0.07      0.05      1.67
                             1,997.00             0.23      0.12      2.79

                                              Other_Sales  Global_Sales
Publisher                    Year_of_Release
0                            0.00                    0.57          6.48
                             2,004.00                0.05          5.30
                             2,005.00                0.03          1.43
                             2,007.00                0.02          1.21
                             2,010.00                0.00          0.16
                             2,011.00                0.00          0.19
                             2,016.00                0.00          0.03
10TACLE Studios              2,006.00                0.00          0.02
                             2,007.00                0.00          0.09
1C Company                   2,009.00                0.00          0.01
                             2,011.00                0.01          0.09
20th Century Fox Video Games 1,981.00                0.01          1.35
                             1,982.00                0.00          0.59
2D Boy                       2,008.00                0.01          0.04
3DO                          1,998.00                0.00          0.40
                             1,999.00                0.17          4.14
                             2,000.00                0.18          3.08
                             2,001.00                0.15          1.45
                             2,002.00                0.08          0.60
                             2,003.00                0.05          0.45
49Games                      2,009.00                0.00          0.03
505 Games                    2,002.00                0.01          0.29
                             2,003.00                0.01          0.10
                             2,004.00                0.09          0.89
                             2,005.00                0.09          1.27
                             2,006.00                0.68          7.40
                             2,007.00                0.97         10.35
                             2,008.00                0.20          2.74
                             2,009.00                0.70          7.43
                             2,010.00                1.31         14.02
                             2,011.00                0.34          3.20
                             2,012.00                0.26          2.25
                             2,013.00                0.25          2.15
                             2,014.00                0.23          1.72
                             2,015.00                0.09          0.64
                             2,016.00                0.08          0.87
5pb                          2,008.00                0.00          0.10
                             2,009.00                0.00          0.18
                             2,010.00                0.00          0.29
                             2,011.00                0.00          0.27
                             2,012.00                0.00          0.26
                             2,013.00                0.00          0.14
                             2,014.00                0.00          0.13
                             2,015.00                0.00          0.22
                             2,016.00                0.00          0.07
7G//AMES                     2,011.00                0.00          0.06
989 Sports                   1,999.00                0.02          0.38
989 Studios                  1,997.00                0.04          0.52
                             1,998.00                0.32          7.54
                             1,999.00                0.31          3.46
AQ Interactive               2,007.00                0.02          0.16
                             2,008.00                0.02          0.22
                             2,009.00                0.01          0.15
ASC Games                    1,996.00                0.09          1.31
                             1,998.00                0.04          0.66
                             1,999.00                0.00          0.05
ASCII Entertainment          1,994.00                0.00          0.87
                             1,995.00                0.00          1.25
                             1,996.00                0.04          1.82
                             1,997.00                0.19          1.23

(d) Qual foi jogo mais vendido na união européia? De que ano ele é e qual a editora?

In [46]:
games[['Name','EU_Sales','Year_of_Release','Publisher']].sort_values(by = ['EU_Sales'], ascending = False).head(1)

         Name  EU_Sales  Year_of_Release Publisher
0  Wii Sports     28.96         2,006.00  Nintendo

(e) Quantos % os generos ['Racing', 'Sports', 'Shooter'] representam na base de dados?

In [47]:
total = games.groupby(['Genre'])['Genre'].count()
total

Genre
0                  2
Action          3370
Adventure       1303
Fighting         849
Misc            1750
Platform         888
Puzzle           580
Racing          1249
Role-Playing    1500
Shooter         1323
Simulation       874
Sports          2348
Strategy         683
Name: Genre, dtype: int64

In [48]:
total.iloc[:].sum()

16719

Racing = 7.47%
Sports = 14.04%
Shooter = 7.91%

(f) Qual plataforma vendeu menos globalmente? obs: imprimir somente o nome

In [49]:
menos_vendido =  games.groupby(['Platform'])[['Global_Sales']].count().reset_index().sort_values(by = 'Global_Sales')
menos_vendido.iloc[0,0]

'GG'

============================================================================================================================

Problema 5
A pasta 'data/datasus' contém informações sobre casos de dengue e tabelas auxiliares.

Tabela	Conteúdo
Dengue	Quantidade de casos por município
Agua	Quantidade de residências em cada município por tipo o abastecimento de água
InstalacoesSanitarias	Quantidade de residências em cada município por tipo de rede de esgoto
Pib	PIB per capita de cada município
Municipios	Relaciona o id_municipio com seu nome e estado
Populacao	Quantidade de pessoas morando em áreas urbanas, rurais e população total por município
Sexo	Quantidade de pessoas por sexo em cada município

In [56]:
agua = pd.read_csv('data2/datasus/Agua.csv')
cid  = pd.read_csv('data2/datasus/Cid10.csv')
dengue  = pd.read_csv('data2/datasus/Dengue.csv')
instalacoes  = pd.read_csv('data2/datasus/InstalacoesSanitarias.csv')
municipios  = pd.read_csv('data2/datasus/Municipios.csv')
pib  = pd.read_csv('data2/datasus/Pib.csv')
populacao  = pd.read_csv('data2/datasus/Populacao.csv')
sexo  = pd.read_csv('data2/datasus/Sexo.csv')

In [ ]:

(a) Calcular o número de casos de dengue por cada estado apresentando os dados em ordem decrescente.

In [67]:
a = dengue.merge(municipios)
a.groupby(['UF'])['casos'].sum().sort_values( ascending = False)

UF
GO    274620
MG     15932
CE     11373
MT      7750
SP      5173
ES      5046
PA      4525
PI      3599
MA      3374
TO      3089
BA      2961
RJ      2658
PE      2151
MS      1678
RN      1418
RO      1324
AM      1237
PB       944
PR       818
AP       817
AC       777
AL       759
SE       334
RR       151
RS        45
SC        13
Name: casos, dtype: int64

(b) Utilizando o dataset InstalacoesSanitarias.csv, determine o número de pessoas que não possuem meio sanitário algum de descarte de dejetos por estado.

In [70]:
b = instalacoes.merge(municipios)

In [73]:
b.groupby(['UF'])['nao_possui'].sum().sort_values( ascending = False)

UF
GO   5,814,249.00
BA   1,201,606.00
MA     946,217.00
PI     649,878.00
CE     645,246.00
PE     478,587.00
PA     306,028.00
MG     268,622.00
PB     217,920.00
AL     212,043.00
AM     211,491.00
TO     115,376.00
AC      73,437.00
RS      65,817.00
SE      62,352.00
RN      62,137.00
MT      52,961.00
PR      33,131.00
RR      29,705.00
SP      23,768.00
RO      22,181.00
RJ      16,987.00
SC      16,219.00
ES      13,060.00
AP      11,208.00
MS       9,010.00
Name: nao_possui, dtype: float64

(c) Crie uma coluna com a posição de ranking considerando o PIB. Os maiores PIB devem ter os menores valores de ranking.

In [103]:
pib1 = pib.sort_values(by=['pib_percapta'], ascending = False).reset_index(drop = True)

In [107]:
ranking =  np.arange(1,5560)
pib1['ranking'] = ranking
pib1

      id_registro  id_municipio  pib_percapta  ranking
0            3153          3155    715,193.70        1
1            2963          2965    340,688.49        2
2            3575          3577    278,145.26        3
3            3231          3233    255,658.30        4
4            5164          5169    254,242.69        5
...           ...           ...           ...      ...
5554          618           618      3,566.34     5555
5555         2107          2109      3,561.71     5556
5556          564           564      3,529.10     5557
5557          644           644      3,510.69     5558
5558          573           573      3,241.29     5559

[5559 rows x 4 columns]

(d) Qual o PIB dos 5 municípios com mais casos de dengue e sua posição no ranking?

In [121]:
d = pib1.merge(dengue, on = 'id_municipio' )
d

      id_registro_x  id_municipio  pib_percapta  ranking  id_registro_y  casos
0              3153          3155    715,193.70        1           1520      3
1              2963          2965    340,688.49        2           1423      1
2              3231          3233    255,658.30        4           1577      3
3              3234          3236    223,042.26        7           1579      1
4              3246          3248    212,966.61        9           1590      1
...             ...           ...           ...      ...            ...    ...
2451           1062          1063      4,053.87     5516            593      7
2452            932           932      3,889.40     5534            489     60
2453            503           503      3,796.10     5540            318      1
2454           1122          1123      3,794.42     5541            627     14
2455            564           564      3,529.10     5557            348      2

[2456 rows x 6 columns]

In [128]:
d.groupby(['id_municipio','pib_percapta','ranking'])['casos'].sum().sort_values( ascending = False).head(5)

id_municipio  pib_percapta  ranking
5566          26,445.72     905        239395
5337          19,774.03     1572        10859
5413          29,034.21     742          9340
949           19,494.40     1602         4321
5215          31,016.19     641          3298
Name: casos, dtype: int64